---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceLoadContent
source: html/07cfe61a-ea9f-1172-7952-02d69d60eba5.htm
---
# ExternalResourceLoadContent Properties

Specifies whether the .NET object represents a valid Revit entity.